package io.ylab.intensive.lesson02.Sequences;
/*
    =====================================
    @project ylabOOP
    @created 11/03/2023    
    @author Bereznev Nikita @CreativeWex
    =====================================
 */

public interface Sequences {
    void a(int n);
    /**
     * Выводит в консоль n первых членов последовательности B
     * @param n число членов последовательности для вывода
     */
    void b(int n);
    /**
     * Выводит в консоль n первых членов последовательности C
     * @param n число членов последовательности для вывода
     */
    void c(int n);
    /**
     * Выводит в консоль n первых членов последовательности D
     * @param n число членов последовательности для вывода
     */
    void d(int n);
    /**
     * Выводит в консоль n первых членов последовательности E
     * @param n число членов последовательности для вывода
     */
    void e(int n);
    /**
     * Выводит в консоль n первых членов последовательности F
     * @param n число членов последовательности для вывода
     */
    void f(int n);
    /**
     * Выводит в консоль n первых членов последовательности G
     * @param n число членов последовательности для вывода
     */
    void g(int n);
    /**
     * Выводит в консоль n первых членов последовательности H
     * @param n число членов последовательности для вывода
     */
    void h(int n);
    /**
     * Выводит в консоль n первых членов последовательности I
     * @param n число членов последовательности для вывода
     */
    void i(int n);
    /**
     * Выводит в консоль n первых членов последовательности J
     * @param n число членов последовательности для вывода
     */
    void j(int n);

}
